apache-jmeter-5.5/bin/Test Plan insert in sqlite.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan insert in sqlite" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">/opt/apache-jmeter-4.0/lib</stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="JDBC users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="MySQL Configuration" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="checkQuery">select 1</stringProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">myDatabase</stringProp>
          <stringProp name="dbUrl">jdbc:sqlite:/Users/amittal/walmart_data</stringProp>
          <stringProp name="driver">org.sqlite.JDBC</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="poolMax">10</stringProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <boolProp name="preinit">false</boolProp>
        </JDBCDataSource>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="random_store" enabled="true">
          <stringProp name="maximumValue">100000</stringProp>
          <stringProp name="minimumValue">1000</stringProp>
          <boolProp name="perThread">true</boolProp>
          <stringProp name="variableName">random_store</stringProp>
        </RandomVariableConfig>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request" enabled="true">
          <stringProp name="dataSource">myDatabase</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="query">SELECT * FROM walmart_data LIMIT 1;
</stringProp>
          <stringProp name="variableNames">Store,Date,Temperature, Fuel_Price,MarkDown1,MarkDown2, MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="random_Fuel_Price" enabled="true">
          <stringProp name="variableName">random_Fuel_Price</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="maximumValue">50</stringProp>
          <boolProp name="perThread">true</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="temperature" enabled="false">
          <stringProp name="variableName">random_temperature</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="maximumValue">100</stringProp>
          <boolProp name="perThread">true</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Markdown1" enabled="true">
          <stringProp name="variableName">random_markdown1</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="maximumValue">10000</stringProp>
          <boolProp name="perThread">true</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Markdown2" enabled="true">
          <stringProp name="variableName">random_markdown2</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="maximumValue">10000</stringProp>
          <boolProp name="perThread">true</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Markdown3" enabled="true">
          <stringProp name="variableName">random_markdown3</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="maximumValue">10000</stringProp>
          <boolProp name="perThread">true</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Markdown4" enabled="true">
          <stringProp name="variableName">random_markdown4</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="maximumValue">10000</stringProp>
          <boolProp name="perThread">true</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Markdown5" enabled="true">
          <stringProp name="variableName">random_markdown5</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="maximumValue">10000</stringProp>
          <boolProp name="perThread">true</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="CPI" enabled="true">
          <stringProp name="variableName">random_cpi</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="maximumValue">10000</stringProp>
          <boolProp name="perThread">true</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Unempl" enabled="true">
          <stringProp name="variableName">random_unemployment</stringProp>
          <stringProp name="minimumValue">1</stringProp>
          <stringProp name="maximumValue">9</stringProp>
          <boolProp name="perThread">true</boolProp>
        </RandomVariableConfig>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Insert walmart store" enabled="true">
          <stringProp name="dataSource">myDatabase</stringProp>
          <stringProp name="queryType">Prepared Update Statement</stringProp>
          <stringProp name="query">INSERT into walmart_data (Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday) values(&apos;1000&apos;,&apos;2022-05-28&apos;,&apos;${Temperature_1}&apos;,&apos;${random_Fuel_Price}&apos;,&apos;5007&apos;,&apos;5657&apos;,&apos;9303&apos;,&apos;6022&apos;,&apos;581&apos;,&apos;5620&apos;,&apos;5&apos;,&apos;TRUE&apos;);</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Update Request" enabled="true">
          <stringProp name="dataSource">myDatabase</stringProp>
          <stringProp name="queryType">Prepared Update Statement</stringProp>
          <stringProp name="query">Update walmart_data set Store=2000 where Fuel_Price=&apos;${random_Fuel_Price}&apos;;</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Delete  Request" enabled="true">
          <stringProp name="dataSource">myDatabase</stringProp>
          <stringProp name="queryType">Prepared Update Statement</stringProp>
          <stringProp name="query">Delete from walmart_data where Fuel_Price=&apos;${random_Fuel_Price}&apos;;</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Debug Sampler" enabled="true">
          <boolProp name="displayJMeterProperties">false</boolProp>
          <boolProp name="displayJMeterVariables">true</boolProp>
          <boolProp name="displaySystemProperties">false</boolProp>
        </DebugSampler>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Query report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/tmp/outputdata/jmeter/myhost/query_reports.${__time(yyyy-MM-dd&apos;T&apos;hh_mm_ssZ)}.csv</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>